{
    "slug": "edelweiss-assisted-living",
    "name": "Edelweiss Assisted Living",
    "phone": "(857) 547-2000",
    "views": 57,
    "state": "MA",
    "featuredImage": "https://placehold.co/600x400",
    "gallery": ["https://placehold.co/600x400", "https://placehold.co/600x400"],
    "popular": true,
    "description": "<p><strong>Edelweiss Assisted Living</strong> offers a comfortable and secure environment for seniors, providing a variety of services and amenities tailored to meet their unique needs.</p><h2>About Us</h2><p>Our facility is designed to provide a home-like atmosphere with modern conveniences and compassionate care. Located in the heart of Massachusetts, we are committed to enhancing the quality of life for our residents.</p><ul><li>24/7 medical support</li><li>Nutritious meals prepared by professional chefs</li><li>Daily social and recreational activities</li><li>Housekeeping and laundry services</li></ul><h2>Our Services</h2><p>At Edelweiss Assisted Living, we offer a range of services to ensure our residents live comfortably and happily:</p><h3>Personal Care</h3><p>We provide personalized care plans to meet the specific needs of each resident, including assistance with daily activities such as bathing, dressing, and medication management.</p><h3>Health and Wellness</h3><p>Our on-site healthcare professionals are available around the clock to provide medical care and support, ensuring our residents receive the best possible health services.</p><blockquote><p>&quot;The staff at Edelweiss Assisted Living are like family. They go above and beyond to make sure we are happy and healthy.&quot; - Resident's family member</p></blockquote><h3>Engaging Activities</h3><p>We offer a variety of activities to keep our residents active and engaged, including:</p><ul><li>Arts and crafts</li><li>Fitness classes</li><li>Music and dance</li><li>Group outings and excursions</li></ul><p>Our goal is to create a vibrant community where residents can enjoy their golden years with dignity and joy. For more information or to schedule a tour, please <a href='mailto:info@edelweissassistedliving.com'>contact us</a> or call us at (857) 547-2000.</p>",
    "location": {
      "latitude": 42.3601,
      "longitude": -71.0589
    }
  }
  